app/Controllers/UserController.php

    public function user()
    {
        $data['users'] = $this->user->findAll();
---
SELECT *
FROM `user`